<?php


namespace APP\classes;


class Blog
{
    public $blogs=[];
    public function __construct()
    {
        $this->blogs=[
            0=>[
                'id'=>1,
                'title'=>'কড়াকড়ির মধ্যেই টিএসসিতে উড়ল ফানুস, আতশবাজিতে বর্ষবরণ',
                'description'=>'খ্রিষ্টীয় বছরের (২০২২) শেষ দিন ‘থার্টি ফার্স্ট নাইট’ ঘিরে একগুচ্ছ নির্দেশনা দিয়েছিল ঢাকা মহানগর পুলিশ (ডিএমপি)। এর মধ্যে অন্যতম নির্দেশনা ছিল কোথাও আতশবাজি, পটকা ফোটানো বা ফানুস ওড়ানো যাবে না। কিন্তু ব্যাপক কড়াকড়ির মধ্যেই ফানুস উড়িয়ে ও আতশবাজি ফুটিয়ে ২০২৩ খ্রিষ্টাব্দের প্রথম প্রহরকে বরণ করে নেওয়া হয়েছে ঢাকা বিশ্ববিদ্যালয়ের ছাত্র-শিক্ষক কেন্দ্র (টিএসসি) এলাকায়। এ সময় টিএসসি এলাকায় পুলিশের বিপুলসংখ্যক সদস্য থাকলেও শিক্ষার্থী ও দর্শনার্থীদের উচ্ছ্বাসে তাঁরা কোনো হস্তক্ষেপ করেননি।',
                'image'=>'assets/img/5.jpg'
            ],
            1=>[
                'id'=>2,
                'title'=>'বিএনপি নেতা খন্দকার মাহবুব হোসেন আর নেই',
                'description'=>'বিএনপির ভাইস চেয়ারম্যান আইনজীবী খন্দকার মাহবুব হোসেন মারা গেছেন (ইন্না লিল্লাহি ওয়া ইন্না ইলাইহি রাজিউন)। শনিবার রাত পৌনে ১১টায় রাজধানীর একটি হাসপাতালে তিনি ইন্তেকাল করেন। 

সুপ্রিম কোর্ট আইনজীবী সমিতির সাবেক সম্পাদক রুহুল কুদ্দুস (কাজল) প্রথম আলোকে এ তথ্য নিশ্চিত করেছেন।',
                'image'=>'assets/img/6.jpg'
            ],
            2=>[
                'id'=>3,
                'title'=>'দেশে দেশে খ্রিষ্টীয় নববর্ষ বরণ',
                'description'=>'৪, ৩, ২, ১...। ঘড়ির সেকেন্ডের কাঁটা ১২ ছোঁয়া মাত্রই রংবেরঙের আলোকচ্ছটায় রঙিন হলো আকাশ। চারপাশে উল্লাসের ধ্বনি। এই আয়োজন, এই আনন্দ খ্রিষ্টীয় নতুন বছর ঘিরে। নিউজিল্যান্ডের অকল্যান্ড শহরে ২০২৩ সালের যাত্রাটা শুরু হয়েছে এভাবেই। শুধু নিউজিল্যান্ডই নয়, পুরোনোকে ঝেড়ে ফেলে নতুন বছরকে নানা আয়োজনের মধ্য দিয়ে বরণ করে নিয়েছেন বিশ্বের বিভিন্ন দেশের মানুষ। চলুন, ছবিতে ছবিতে দেখে নেওয়া যাক উদ্‌যাপনের সেসব চিত্র।',
                'image'=>'assets/img/7.jpg'
            ],
];
    }

    public function addBlog()
    {

        return $this->blogs;
    }
    public function getDetailsBlog($id)
    {
        foreach ($this->blogs as $blog)
        {
            if ($blog['id'] == $id)
            {
                return $blog;
            }
        }
    }

}